HELLO = 'Привет, %s\!\nТы здесь, потому тобой была оставлена заявка на оффлайн мероприятие *Elbrus Bootcamp*\. \n\n 👾 🤖 🫖 ☕️ \
\nЧтобы мы с тобой могли отлично провести время и не потерялись, я *попрошу тебя ответить* на несколько вопросов\. Ответы я запишу\. \
\nПосле этого, когда ты будешь уже подходить к кампусу и если тебе понадобится помощь, ты сможешь уточнить у меня дорогу\. \
\nА когда настанет время – ты сможешь оповестить организатора мероприятия, \
чтобы тебя забрали с диванов ожидания, которые расположены прямо за стенкой ресепшена\! \
\n \
\nМожно мне записать твои *контактные данные*\?'

CAME_TO = 'И кстати, к кому ты идёшь\? \n *JavaScript* или *Data Science*\?'

NAME = 'Давай уточним как тебя зовут? Напиши, пожалуйста, своё *имя* и *фамилию* 🙂'
CAME_FROM = 'Приятно познакомиться, %s\! Откуда у тебя информация об Elbrus Bootcamp и об этом мероприятии\? \
Можешь ответить в одно предложение\. Например, «узнал из рекламы в instagram»\!'
TEL_NUMBER = '%s, напиши, пожалуйста, свой номер телефона в формате \+79876543210'
EMAIL = 'Так, замечательно\! Поделись, пожалуйста, ещё и своей почтой\. Так ты не пропустишь важные новости от буткемпа\! \
\nОбещаем, что не будет спамить тебе\.\n🤥'

CONFIRM_TEXT = 'твоё имя {}, информация об Эльбрусе была получена здесь – {}, \
твой номер телефона {}, почта – {}, ну и мероприятие направления {} тебя интересует. Всё верно?'

MAP = 'Отлично, %s! Напоминаю наш адрес:\nhttps://yandex.ru/maps/-/CCUiQ2vM~B \n'
NO_TEXT = 'Так, %s, нам нужно начать заново\?'
PHOTO = 'pass'
HERE = 'pass'
TEL_ERROR = 'Попробуй ещё раз ввести один номер телефона в формате "+79876543210"! \
Если хочешь, можешь в таком формате "88005553535"'
EMAIL_ERROR = 'Попробуй ещё раз ввести свою электронную почту в формате "info@elbrusboot.camp"'

HELP_TEXT = '🧐 \nКак тебе помочь %s? Описание бота'

NOT_TARGET_CONTENT_TYPES = ['photo', 'audio', 'document', 'sticker',
'video', 'video_note', 'voice','location','contact', 'new_chat_members',
'left_chat_member','new_chat_title', 'new_chat_photo', 'delete_chat_photo',
'group_chat_created', 'supergroup_chat_created', 'channel_chat_created',
'migrate_to_chat_id', 'migrate_from_chat_id', 'pinned_message']

NOT_TARGET_TEXT = 'Извини, %s, этот бот обрабатывает только текстовые данные\!'